//Напишете програма, която разчита 100 числа от клавиатурата, разделени със ‘\n’ (new line).
//Програмата трябва да принтира всички числа с изключение на тези, които са по-малко
//от 0 и по-големи от 100, като числата са разделени с character ‘ ’ (space). Числата
//са цели и са от -500 до +500

#include <stdio.h>
#include <stdlib.h>

int main()
{
    int arr[100];
    int i,j, var;
    for(i = 0; i < 100; i++)
    {
        scanf("%d",&var);
        arr[i] = var;
    }
    for(j = 0; j < 100; j++)
    {
        if(arr[j] >= 0 && arr[j] <= 100)
        {
            printf("%d ",arr[j]);
        }
    }
    return 0;
}
